// ##############################################
// # 製作者 Twitter @_hirony_			#
// # よくあるHello Worldプログラム。		#
// ##############################################


// Java001クラス
public class Java001{
	// mainメソッド
	public static void main(String[] args){
		// 文字列を描画する命令文
		System.out.println("Hello World");
	}
}


/* ################## 補足 ################### */

// 8行目
// ファイル名とクラス名は同じ名前にしましょう。

// 10行目
// プログラムの色々な処理はmainメソッド
// (public static void main(String[] args){})の”{}”の中に記述します
// なぜならプログラムは実行するとき一番最初にmainメソッドを呼び出すからです


// これがJavaの基本構文です
// ”最初は”おまじないとして覚えます
// publicって？staticって？voidは？と思われるかもしれませんが
// ”今は”おまじないとして覚えてください
